Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Your textFieldDidEndEditing(_:) method should look like this:
ja: あなたのtextFieldDidEndEditing(_:)メソッドはこのように見えるはずです：

source: Your textFieldShouldReturn(_:) method should look like this:
ja: あなたのtextFieldShouldReturn(_:)メソッドはこのように見えるはずです：

source: Your unwindToMealList(_:) action method should look like this:
ja: あなたのunwindToMealList(_:)アクションメソッドはこのように見えるはずです：

source: Your unwindToMealList(sender:) action method should look like this:
ja: あなたのunwindToMealList(sender:)アクションメソッドはこのように見えるはずです：

source: Your viewDidLoad() method should look like this:
ja: あなたのviewDidLoad()メソッドはこのように見えるはずです：

source: Your viewDidLoad() method should look something like this:
ja: あなたのviewDidLoad()メソッドはこのようにものに見えるはずです：

source: Your Xcode window should look something like this:
ja: あなたのXcodeはこのようなものに見えるはずです：

source: Your asset catalog should look something like this:
ja: あなたのアセットカタログはこのようなものに見えるはずです：

source: Your custom interface will then contain the meal name, photo, rating, and look something like this:
ja: あなたのカスタムインターフェイスは、そのとき食事名、写真、格付けを含み、そしてこのようなものに見えるでしょう：

source: Your dialog should look like this:
ja: あなたのダイアログはこのように見えるはずです：

source: Your food tracker tests should appear as shown below:
ja: あなたの食事追跡テストは、下で示すように見えるはずです：

source: Your image view now has a 1:1 aspect ratio, so it will always be a square.
ja: あなたのイメージビューは、今では１:１の縦横比を持ちます、それでそれは常に正方形です。

source: Your implementation then calls the setupButtons() method.
ja: あなたの実装は、それからsetupButtons()メソッドを呼び出します。

source: Your job is to implement the appropriate protocol methods in your table view controller subclass so that your table view has the correct behavior.
ja: あなたの仕事は、適切なプロトコルメソッドをあなたのビューコントローラサブクラスに実装して、あなたのテーブルビュが正しく振舞うようにすることです。

source: Your meal detail scene user interface should look something like this:
ja: あなたの食事詳細シーンのユーザインターフェイスはこのようにものに見えるはずです：

source: Your outlets in MealTableViewCell.swift should look like this:
ja: あなたのアウトレットはMealTableViewCell.swiftにおいてこのように見えるはずです：

source: Your scene should look like this:
ja: あなたのシーンはこのように見えるはずです：

source: Your scene should look similar to this:
ja: あなたのシーンはこれと似たものに見えるはずです：

source: Your scene should look something like this:
ja: あなたのシーンはこのようなものに見えるはずです：

source: Your storyboard should look similar to this:
ja: あなたのストーリーボードはこのように見えるはずです：

source: Your table view has only a single section, and each Meal object should have its own row.
ja: あなたのテーブルビューは、単に１つだけのセクションを持ちます、そして各Mealオブジェクトはそれ独自の列を持つべきです。

source: Your unit test class should look like this:
ja: あなたのユニットテストクラスは、このように見えるはずです：

source: Your user interface should look something like this:
ja: あなたのユーザインターフェイスはこのようなものに見えるはずです：

source: You’ll add that code next.
ja: あなたは、そのコードを次に加えます。

source: You’ll also be working with a class from the UIKit framework, so you need to import UIKit.
ja: あなたはまた、UIKitフレームワーク由来のクラスを扱っているでしょう、なのであなたはUIKitをインポートする必要があります。

source: You’ll also center the elements in your stack view to balance the user interface.
ja: あなたはまた、あなたのスタックビューの要素の中心をとってユーザインターフェイスのつり合いをとりたいでしょう。

source: You’ll be using some of these methods in the FoodTracker app to load and display your data.
ja: あなたは、これらのメソッドの幾つかをFoodTrackerアプリで使ってあなたのデータをロードして表示することになるでしょう。

source: You’ll become familiar with the structure of a project in Xcode and learn how to navigate between and use basic project components.
ja: あなたは、Xcodeにおけるプロジェクトの構造に馴染んで、基本的なプロジェクトコンポーネントの間をなんとか進んでいき、それを使用する方法を学びます。

source: You’ll come back to working on the table view itself in a little while, after you design an interface for what the table view displays: its table view cells.
ja: あなたは、テーブルビューそれ自体での作業に少ししたら戻ってきます、あなたがインターフェイス設計を、テーブルビューが表示するのは何か、についてした後にです：それはテーブルビューセル（表のます目）です。

source: You’ll configure the buttons to save or cancel adding a new meal and to bring the user back to the meal list soon.
ja: あなたはこれらのボタンを、新しい食事の追加を保存またはキャンセルして、ユーザが食事リストにすぐに戻るように構成します。

source: You’ll create a stack view subclass that manages a row of buttons representing the stars.
ja: あなたは、あるスタックビューサブクラスを作成し、それは星を表すボタンの列を管理します。

source: You’ll create the new scene using a table view controller.
ja: あなたは、新しいシーンを作成するのにテーブルビューコントローラを使います。

source: You’ll define your custom control entirely in code, and then add it to your storyboard.
ja: あなたは、あなたのカスタムコントロールをすっかりコード中に定義して、それからそれをあなたのストーリーボードへ加えます。

source: You’ll differentiate the segues based on the identifiers you assign to them: AddItem when adding new meals and ShowDetail when editing an existing meal.
ja: あなたは、セグエをあなたがそれらに割り当てる識別子：新しい食事を割り当てる時のAddItemと既存の食事を編集する時のShowDetailに基づいて区別します。

source: You’ll even see the blue highlighted star while you are touching the button, but your buttons don’t change to the filled images yet.
ja: あなたは、青く強調された星をあなたがボタンをタッチしている間は見さえするでしょう、しかしあなたのボタンは塗りつぶされた画像へとまだ変化しません。

source: You’ll find that code completion is one of the great time-saving features of Xcode.
ja: あなたは、コード補完がXcodeの偉大な時間節約機能の１つであることを発見するでしょう。

source: You’ll finish a more advanced implementation of this method in a little while, but for now, the unwindToMealList(_:) action method should look like this:
ja: あなたは、このメソッドのより進んだ実装を少し後でやり遂げます、しかし今のところ、unwindToMealList(_:)アクションメソッドはこのように見えるはずです：

source: You’ll fix that next.
ja: あなたはこれを次に修正します。

source: You’ll implement a check that determines how the current scene was presented when the user taps the Cancel button.
ja: あなたはある検査を実装して、現在のシーンが表現された方法をユーザがCancelボタンをタップする時に特定します。

source: You’ll implement this method in MealViewController to do exactly that.
ja: あなたは、このメソッドをMealViewControllerにおいて実装することで厳密にそれが実行されるようにします。

source: You’ll learn more about the roles of views and view controllers soon.
ja: あなたはすぐに、もっとビューおよびビューコントローラについて学びます。

source: You’ll make a change to the label outlet (mealNameLabel) in a later lesson.
ja: あなたは、あとのレッスンでラベルアウトレット（mealNameLabel）に変更を行います。

source: You’ll need a label, an image view, and a rating control.
ja: あなたはラベル、イメージビュー、そして格付けコントロールを必要とします。

source: You’ll need this feature later to let users interact with the image view.
ja: あなたは、ユーザがイメージビューと相互作用できるようにするためにこの機能を後で必要とします。

source: You’ll need to click OK on the alert that asks for permission to give the FoodTracker app access to Photos.
ja: あなたは、FoodTrackerアプリをPhotosにアクセスさせるよう許可を求める警告上でOKをクリックする必要があるでしょう。

source: You’ll need to create outlets for the text field and label in your user interface to be able to reference them.
ja: あなたが必要なのは、あなたのユーザインターフェイスの中のテキスト欄とラベルに対するアウトレットを作成して、それらが参照されることができるようにすることです。

source: You’ll need to keep track of a rating value, as well as the buttons that a user taps to set that rating.
ja: あなたが必要とするのは、格付けの値の、それだけでなくユーザがその格付けを設定するためにタップするボタンの、最新の状態を把握することです。

source: You’ll need to return nil to indicate that the item couldn’t be created, and has set to the default values.
ja: あなたが必要とするのはnilを返すことでその項目が作成されることができなかったのを示すこと、そして省略時の値に設定されるようにすることです。

source: You’ll notice that the text field still isn’t stretching to the far edge of the scene.
ja: あなたはテキスト欄がまだ伸びておらず、シーンの端まで遠いのに気づくでしょう。

source: You’ll notice the sections you denoted by //MARK: listed here.
ja: あなたは、ここでリストされた//MARK:によってあなたが示した部門に気づくでしょう。

source: You’ll notice the user interface elements space out vertically, and the stack view grows with them.
ja: あなたは、ユーザインターフェイス要素が垂直方向に間隔をあけ、そしてスタックビューがそれらとともに大きくなるのに気づくでしょう。

source: You’ll notice there’s a little bit of overlap between the table view cells and the status bar—you’ll fix that in the next lesson.
ja: あなたは、テーブルビューセルとステータスパーが少しばかり重なっているのに気がつくでしょう—あなたは次のレッスンでそれを修正します。

source: You’ll rearrange the existing user interface elements and work with an image picker to add a photo to the scene.
ja: あなたは、既存のユーザインターフェイス要素を並べ直して、イメージピッカーを取り扱うことで写真をシーンへ加えます。

source: You’ll replace this debugging implementation with a real implementation in a little while.
ja: あなたは、このデバック実装を実際の実装としばらくして置き換えます。

source: You’ll replace this with a new implementation soon.
ja: あなたはこれを新しい実装でまもなく置き換えます。

source: You’ll see this in action later.
ja: あなたは、これを後でアクションで見るでしょう。

source: You’ll start by working on a user interface for the scene that lets you add a new meal to your meal tracking app, FoodTracker.
ja: あなたは、新しい食事をあなたの食事追跡アプリ、FoodTrackerに加えるシーンのユーザインターフェイス上で作業することで始めます。

source: You’ll start writing code in this source code file later in this lesson.
ja: あなたは、後ほどこのレッスンでこのソースコードファイルにコードを書き始めます。

source: You’ll use the areas identified in the window below throughout the lessons.
ja: あなたはレッスンを通して下のウインドウにおいて確認される区画を使います。

source: You’ll use these images when you load initial meal data into your app.
ja: あなたがこれらの画像を使うのは、あなたが最初の食事画像データをあなたのアプリにロードする時です。

source: You’re attaching the ratingButtonTapped(_:) action method to the button object, which will be triggered whenever the .TouchDown event occurs.
ja: あなたは、ratingButtonTapped(_:)アクションをbuttonオブジェクトに取り付けています、それは.TouchDownイベントが起こるたびに作動させられます。

source: You’re close to finalizing the meal scene’s user interface, but first you need to do some cleanup.
ja: あなたは、食事シーンのユーザインターフェイスの完成段階に近づいています、しかしまずあなたはいくらかの掃除をする必要があります。

source: You’re making these variables (var) instead of constants (let) because they’ll need to change throughout the course of a Meal object’s lifetime.
ja: あなたは、これらを変数（var）にします、定数（let）ではなく、なぜならそれらはMealオブジェクトのライフタイムの流れを通してずっと変更を必要とするからです。

source: You’re not using your new class for anything yet, but building it gives the compiler a chance to verify that you haven’t made any typing mistakes.
ja: あなたはあなたの新しいクラスをまだ何にも使いません、しかしそれをビルドすることはコンパイラに機会を与えてあなたが何ひとつタイプし間違えなかったことを検証します。

source: You’re ready to start working on a storyboard for your app.
ja: あなたは、あなたのアプリのストーリーボードで作業を始める準備ができています。

source: You’re using a different process to create this class than the RatingControl class you created earlier (iOS > Source > Cocoa Touch Class), because you’re defining a base class for your data model, which means it doesn’t need to inherit from any other classes.
ja: あなたは、以前にあなたが作成したRatingControlクラス（iOS > Source > Cocoa Touch Class）とは異なる過程でこのクラスを作成しています、なぜならあなたが定義しているのはあなたのデータモデルのためのベースクラスだからです、それが意味するのは、それが何ら他のクラスから継承する必要がないということです。

source: You’ve added several of these comments so far.
ja: あなたは、いくつかこれらのコメントを今までに加えました。

source: You’ve also added code to update the user interface as the user interacts with the controls.
ja: あなたはまたコードを追加して、ユーザがコントロールと相互作用するようにユーザインターフェイスを更新しました。

source: You’ve also built a simple user interface.
ja: あなたはまた、簡単なユーザインターフェイスを組み立てました。

source: You’ve also learned how to add gesture recognizers to a view, and how to select photos from the photo library.
ja: あなたはまた、ジェスチャリコグナイザをビューに加える方法と、フォトライブラリから写真を選択する方法を学びました。

source: action
ja: アクション

source: activity viewer
ja: アクティビティビューア

source: adaptive interface
ja: 適応インターフェイス

source: adopt
ja: 採用する

source: app delegate
ja: アプリデリゲート（アプリの委任先）

source: application object
ja: アプリケーションオブジェクト

source: application programming interface (API)
ja: アプリケーションプログラミングインターフェイス（API）

source: argument
ja: 引数

source: array
ja: 配列

source: asset catalog
ja: アセットカタログ（資産目録）

source: assistant editor
ja: アシスタントエディタ

source: base class
ja: 基盤クラス

source: canvas
ja: キャンバス

source: class
ja: クラス

source: class hierarchy
ja: クラス階層

source: clean
ja: クリーン

source: closed range operator
ja: 完結範囲演算子

source: closure
ja: クロージャ

source: code completion
ja: コード補完

source: comment
ja: コメント

source: completion handler
ja: 完了ハンドラ

source: conditional statement
ja: 条件文

source: conform to
ja: 準拠する

source: console
ja: コンソール

source: constant
ja: 定数

source: constraint
ja: 制約

source: content view
ja: コンテンツビュー

source: control
ja: コントロール

source: convenience initializer
ja: 便宜イニシャライザ

source: data model
ja: データモデル

source: data source
ja: データソース

source: delegate
ja: デリゲート（委任先、移譲先）

source: designated initializer
ja: 指定イニシャライザ

source: destination view controller
ja: デスティネーションビューコントローラ（行先ビューコントローラ）

source: downcast
ja: ダウンキャスト

source: entry point
ja: エントリポイント

source: enumeration
ja: 列挙

source: event-driven programming
ja: イベント駆動プログラミング

source: extension
ja: 拡張

source: failable initializer
ja: 失敗できるイニシャライザ

source: find the for-in declaration.
ja: for-in宣言を見つけてください。

source: first responder
ja: ファーストレスポンダ

source: fix-it
ja: 修正

source: force-unwrap operator
ja: 強制アンラップ演算子

source: forced type cast operator
ja: 強制型キャスト演算子

source: function
ja: 関数

source: gesture recognizer
ja: ジェスチャリコグナイザ（身振り認識）

source: global
ja: グローバル

source: half-open range operator
ja: 半開範囲演算子

source: iOS and Swift Terminology
ja: iOSとSwiftの専門用語

source: iOS apps are based on event-driven programming.
ja: iOSアプリは、イベント駆動プログラミングに基づきます。

source: iOS automatically calls these methods at appropriate times when a view controller transitions between states.
ja: iOSは、自動的にそれらのメソッドを適切な時に呼びます、その時とはあるビューコントローラが２つの状態間を推移するときです。

source: iOS calls the UIViewController methods as follows:
ja: iOSはUIViewControllerメソッドを以下のように呼び出します：

source: iOS handles all of the redrawing code for you, so this is actually all the code you need to write for now.
ja: iOSは、再描画コードのすべてをあなたの代わりに取り扱います、それでこれが実際さしあたってあなたが書く必要のあるコードのすべてです。

source: iOS has many persistent data storage solutions; in this lesson, you’ll use NSCoding as the data persistence mechanism in the FoodTracker app.
ja: iOSは、多くの永続データ貯蔵の解決策を持ちます；このレッスンでは、あなたはNSCodingをデータ永続の仕組みとしてFoodTrackerアプリで使います。

source: identity operator
ja: 同一性演算子

source: immutable
ja: 不変

source: implement
ja: 実装する

source: implicitly unwrapped optional
ja: 暗黙的アンラップオプショナル

source: inheritance
ja: 継承

source: initializer
ja: イニシャライザ（初期化子）

source: inspector pane
ja: インスペクタ枠

source: instance
ja: インスタンス

source: integrated development environment (IDE)
ja: 統合開発環境（IDE）

source: intrinsic content size
ja: 固有コンテンツサイズ

source: iterate
ja: イテレート（反復適用）

source: library pane
ja: ライブラリ枠

source: local
ja: ローカル（局所的）

source: loop
ja: ループ

source: method
ja: メソッド

source: modal segue
ja: モーダルセグエ

source: mutable
ja: 可変

source: navigation controller
ja: ナビゲーションコントローラ

source: navigation stack
ja: ナビゲーションスタック

source: nil
ja: 無

source: nil coalescing operator
ja: nil合体演算子

source: object
ja: オブジェクト

source: optional
ja: オプショナル

source: optional binding
ja: オプショナル束縛

source: optional type cast operator
ja: オプショナル型キャスト演算子

source: or constructed as part of adding a new meal.
ja: （または加えている新しい食事の一部として組み立てられます。）

source: outlet
ja: アウトレット（出口、コンセント差し込み口）

source: outline view
ja: アウトラインビュー（外観図）

source: override
ja: オーバーライド（優先させる）

source: parameter
ja: パラメータ

source: playground
ja: プレイグラウンド（遊び場）

source: project navigator
ja: プロジェクトナビゲータ

source: property
ja: プロパティ

source: property observer
ja: プロパティオブザーバ

source: protocol
ja: プロトコル

source: read-only
ja: 読み出し専用

source: read-write
ja: 書き込み専用

source: resize handles
ja: リサイズハンドル（寸法調節つまみ）

source: root view controller
ja: ルートビューコントローラ

source: run loop
ja: 実行ループ

source: runtime
ja: 実行時

source: scene
ja: シーン（場面）

source: scene dock
ja: シーンドック

source: segue
ja: セグエ（遷移）

source: show segue
ja: 表示セグエ

source: source view controller
ja: ソースビューコントローラ（発生ビューコントローラ）

source: storyboard
ja: ストーリーボード（物語展開を絵で表したもの、アプリの展開）

source: storyboard entry point
ja: ストーリーボードエントリポイント

source: string interpolation
ja: 文字列補間

source: structure
ja: 構造体

source: subclass
ja: サブクラス（下位クラス）

source: subview
ja: サブビュー

source: superclass
ja: スーパークラス

source: superview
ja: スーパービュー

source: target
ja: ターゲット

source: target-action
ja: ターゲットアクション

source: tuple
ja: タプル

source: type casting
ja: 型キャスト

source: type inference
ja: 型推論

source: underscore
ja: アンダースコア

source: unit test
ja: ユニットテスト

source: unwind segue
ja: 巻き戻しセグエ

source: unwrap
ja: アンラップ

source: user interface (UI)
ja: ユーザインターフェイス（UI）

source: utility area
ja: ユーティリティ区画

source: variable
ja: 変数

source: view
ja: ビュー

source: view controller
ja: ビューコントローラ

source: view hierarchy
ja: ビュー階層

source: workspace window
ja: ワークスペースウインドウ
